#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
module.cvalexmav_web.data.aws_acm_certificate.this: Reading...
module.cvalexmav_web.data.aws_cloudfront_distribution.staging: Reading...
module.cvalexmav_web.aws_cloudfront_origin_access_identity.this: Refreshing state... [id=E3N5JSK2MAVPB4]
module.cvalexmav_web.aws_s3_bucket.this: Refreshing state... [id=cv.alexmav.co.uk]
module.cvalexmav_web.data.aws_acm_certificate.this: Read complete after 1s [id=arn:aws:acm:us-east-1:582037776064:certificate/4d5589f6-34ea-40e5-84b7-901aea2bd3ce]
module.cvalexmav_web.data.aws_cloudfront_distribution.staging: Read complete after 1s [id=E1AGIL3B6UY55K]
module.cvalexmav_web.aws_s3_bucket_public_access_block.this: Refreshing state... [id=cv.alexmav.co.uk]
module.cvalexmav_web.aws_s3_bucket_server_side_encryption_configuration.this: Refreshing state... [id=cv.alexmav.co.uk]
module.cvalexmav_web.aws_s3_bucket_ownership_controls.this: Refreshing state... [id=cv.alexmav.co.uk]
module.cvalexmav_web.data.aws_iam_policy_document.this_policy: Reading...
module.cvalexmav_web.aws_s3_bucket_website_configuration.this[0]: Refreshing state... [id=cv.alexmav.co.uk]
module.cvalexmav_web.data.aws_iam_policy_document.this_policy: Read complete after 0s [id=2599627922]
module.cvalexmav_web.aws_s3_bucket_policy.this[0]: Refreshing state... [id=cv.alexmav.co.uk]
module.cvalexmav_web.aws_cloudfront_distribution.this: Refreshing state... [id=E35XS7VNMG54Q7]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.cvalexmav_web.aws_cloudfront_continuous_deployment_policy.cdn_policy will be created
  + resource "aws_cloudfront_continuous_deployment_policy" "cdn_policy" {
      + enabled            = true
      + etag               = (known after apply)
      + id                 = (known after apply)
      + last_modified_time = (known after apply)

      + staging_distribution_dns_names {
          + items    = [
              + "d3qb02x0fah8jh.cloudfront.net",
            ]
          + quantity = 1
        }

      + traffic_config {
          + type = "SingleWeight"

          + single_weight_config {
              + weight = 0.01
            }
        }
    }

  # module.cvalexmav_web.aws_cloudfront_distribution.this will be updated in-place
  ~ resource "aws_cloudfront_distribution" "this" {
      + continuous_deployment_policy_id = (known after apply)
        id                              = "E35XS7VNMG54Q7"
        tags                            = {
            "Environment"   = "Production"
            "Service_Group" = "CV_Website"
        }
        # (21 unchanged attributes hidden)

        # (6 unchanged blocks hidden)
    }

Plan: 1 to add, 1 to change, 0 to destroy.

Warning: Reference to undefined provider

  on modules.tf line 15, in module "cvalexmav_web":
  15:     aws.virginia = aws.virginia

There is no explicit declaration for local provider name "aws.virginia" in
module.cvalexmav_web, so Terraform is assuming you mean to pass a
configuration for "hashicorp/aws".

If you also control the child module, add a required_providers entry named
"aws.virginia" with the source address "hashicorp/aws".

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>
*Pushed by: @amavrogiannis, Action: `pull_request`*